import numpy as np
import matplotlib.pyplot as plt

# PEFSA = [10, 9, 8, 7, 6, 6, 5, 4, 4, 4]

# CHEN = [4, 6, 8, 10, 11, 10, 10, 9, 9, 7, 7, 5, 5, 4, 4]
       
# SUBEP = [4, 5, 6, 7, 8, 9, 10, 9, 10, 9, 8, 9, 8, 9, 8, 9, 8, 9, 7, 8, 7, 7, 6, 7, 6, 7, 5, 6, 5, 4, 5, 6, 5, 5, 4, 5, 4, 5, 4, 3, 3, 2, 2, 2]

# FAST = [4, 4, 5, 6, 6, 7, 8, 8, 9, 9, 9, 10, 10, 10, 9, 9, 9, 8, 8, 8, 7, 7, 7, 6, 6, 6, 5]

# ILCM = [4, 6, 8, 10, 9, 8, 7, 6, 6, 5, 4, 3, 2, 3, 1, 2, 1, 2]

# ADAPTIVE = [4, 4, 5, 6, 6, 7, 7, 7, 8, 8, 8, 9, 9, 9, 8, 8, 8, 9, 9, 9, 8, 8, 8, 9, 9, 9, 8, 8, 8, 7, 7, 7, 6, 6, 6, 5]


# plt.plot(np.arange(0, len(PEFSA), 1), PEFSA, marker=".")
# plt.plot(np.arange(0, len(CHEN), 1), CHEN, marker=".")
# plt.plot(np.arange(0, len(SUBEP), 1), SUBEP, marker=".")
# plt.plot(np.arange(0, len(FAST), 1), FAST, marker=".")
# plt.plot(np.arange(0, len(ILCM), 1), ILCM, marker=".")
# plt.plot(np.arange(0, len(ADAPTIVE), 1), ADAPTIVE, marker=".")

# plt.title("Идентификация 800 меток")

# plt.xlabel("Номер Раунда")

# plt.ylabel("Параметр Q")

# plt.legend(['Pefsa', 'Chen', 'Subep', 'Fast', 'ILCM', 'Adaptive'])

# plt.grid()

# plt.show()

# =====================================================================================================
# -----------------------------------------------------------------------------------------------------
# =====================================================================================================

# x = [0.0, 0.0005,  0.001, 0.002, 0.003, 0.004, 0.005, 0.006, 0.007, 0.008, 0.009, 0.01]

# PEFSA = [0.47, 0.53, 0.57, 0.65,  0.71, 0.78, 0.94, 1.06, 1.26, 1.35, 1.58, 1.88]

# CHEN = [0.49, 0.51, 0.54, 0.63, 0.72, 0.83, 0.95, 1.15, 1.3, 1.38, 1.65, 1.95]
       
# SUBEP = [0.48, 0.55, 0.58, 0.66, 0.78, 0.86, 1.00, 1.17, 1.35, 1.45, 1.68, 1.97]

# FAST = [0.52, 0.58, 0.62, 0.71, 0.82, 0.92, 1.03, 1.20, 1.40, 1.51, 1.78, 2.09]

# ILCM = [0.49, 0.55, 0.58, 0.67, 0.76, 0.85, 0.98, 1.14, 1.31, 1.46, 1.7, 2.05]

# ADAPTIVE = [0.53, 0.58, 0.60, 0.72, 0.81, 0.95, 1.08, 1.18, 1.38, 1.54, 1.81, 2.05]

# plt.plot(x, PEFSA, marker=".")
# plt.plot(x, CHEN, marker=".")
# plt.plot(x, SUBEP, marker=".")
# plt.plot(x, FAST, marker=".")
# plt.plot(x, ILCM, marker=".")
# plt.plot(x, ADAPTIVE, marker=".")

# plt.title("Идентификация 200 меток")

# plt.xlabel("BER")

# plt.ylabel("Длительность идентификации, с")

# plt.legend(['Pefsa', 'Chen', 'Subep', 'Fast', 'ILCM', 'Adaptive'])

# plt.grid()

# plt.show()

# =====================================================================================================
# -----------------------------------------------------------------------------------------------------
# =====================================================================================================

# x = [0, 50, 100, 200, 400, 800, 1200, 1600, 2000, 2600, 3200]

# PEFSA = [0, 0.115, 0.226, 0.465, 0.923, 1.843, 2.74, 3.68, 4.52, 5.8, 7.11]

# CHEN = [0, 0.122, 0.239, 0.475, 0.94, 1.9, 2.84, 3.86, 4.88, 6.31, 7.85]
       
# SUBEP = [0, 0.122, 0.232, 0.475, 0.95, 1.91, 2.82, 3.72, 4.67, 6.03, 7.42]

# FAST = [0, 0.124, 0.255, 0.526, 1.062, 2.074, 3.00, 4.32, 5.45, 6.78, 8.58]

# ILCM = [0, 0.124, 0.235, 0.465, 0.96, 1.94, 2.96, 3.82, 5.00, 6.54, 7.92]

# ADAPTIVE = [0, 0.122, 0.249, 0.522, 1.078, 2.137, 3.06, 4.24, 5.30, 6.67, 8.6 ]


# plt.plot(x, PEFSA, marker=".")
# plt.plot(x, CHEN, marker=".")
# plt.plot(x, SUBEP, marker=".")

# plt.xlabel("Число меток")

# plt.ylabel("Длительность идентификации, с")

# plt.legend(['Pefsa, TIR = 450 м/с', 'Chen, TIR = 410 м/с', 'Subep, TIR = 430 м/с'])


# plt.plot(x, FAST, marker=".", color="red")
# plt.plot(x, ILCM, marker=".", color="#9467bd")
# plt.plot(x, ADAPTIVE, marker=".", color="#8c564b")

# plt.xlabel("Число меток")

# plt.ylabel("Длительность идентификации, с")

# plt.legend(['Fast, TIR = 370 м/с', 'ILCM, TIR = 400 м/с', 'Adaptive, TIR = 370 м/с'])

# plt.grid()

# plt.show()


# =====================================================================================================
# -----------------------------------------------------------------------------------------------------
# =====================================================================================================



# tags = [50, 100, 200, 400, 800, 1200, 1600, 2000, 2600, 3200]

# PEFSA = [0.115, 0.226, 0.465, 0.923, 1.843, 2.74, 3.651, 4.52, 5.8, 7.11]

# CHEN = [0.122, 0.239, 0.475, 0.94, 1.9, 2.84, 3.86, 4.88, 6.31, 7.85]
       
# SUBEP = [0.122, 0.232, 0.475, 0.95, 1.91, 2.82, 3.72, 4.67, 6.03, 7.42]

# FAST = [0.124, 0.255, 0.526, 1.062, 2.074, 3.00, 4.32, 5.45, 6.78, 8.58]

# ILCM = [0.124, 0.235, 0.465, 0.96, 1.94, 2.96, 3.96, 5.00, 6.54, 7.92]

# ADAPTIVE = [0.122, 0.249, 0.522, 1.078, 2.137, 3.06, 4.24, 5.30, 6.67, 8.6 ]


# plt.plot(tags, list(map(lambda x, y: x/y ,tags, PEFSA)), marker=".")
# plt.plot(tags, list(map(lambda x, y: x/y ,tags, CHEN)), marker=".")
# plt.plot(tags, list(map(lambda x, y: x/y ,tags, SUBEP)), marker=".")
# plt.plot(tags, list(map(lambda x, y: x/y ,tags, FAST)), marker=".")
# plt.plot(tags, list(map(lambda x, y: x/y ,tags, ILCM)), marker=".")
# plt.plot(tags, list(map(lambda x, y: x/y ,tags, ADAPTIVE)), marker=".")

# plt.xlabel("Число меток")

# plt.ylabel("Скорость идентификации, м/с")

# plt.legend(['Pefsa', 'Chen', 'Subep', 'Fast', 'ILCM', 'Adaptive'])

# plt.grid()

# plt.show()


# =====================================================================================================
# -----------------------------------------------------------------------------------------------------
# =====================================================================================================


# tags = [50, 100, 150, 200, 250, 300, 350, 400]

# b1 = [220, 420, 650, 840, 1080, 1220, 1500, 1740]

# b2 = [175, 320, 480, 630, 800, 970, 1100, 1270]

# b3 = [120, 240, 360, 470, 600, 730, 810, 960]

# b4 = [90, 175, 270, 355, 440, 530, 630, 710]

# b5 = [65, 130, 200, 265, 335, 390, 460, 530]

# plt.plot(tags, b1, marker=".")
# plt.plot(tags, b2, marker=".")
# plt.plot(tags, b3, marker=".")
# plt.plot(tags, b4, marker=".")
# plt.plot(tags, b5, marker=".")
# plt.plot(tags, tags, marker=".")



# plt.xlabel("Число меток")

# plt.ylabel("Кол-во слотов с одним ответом")

# plt.legend(['BER = 0.01', 'BER = 0.008', 'BER = 0.006', 'BER = 0.004', 'BER = 0.002', 'BER = 0'])

# plt.grid()

# plt.show()


tags = [50, 100, 200, 400, 800, 1600, 2500, 3200]

ILCM = [160, 300, 600, 1200, 2600, 5200, 8400, 12540]

CHEN = [170, 340, 710, 1450, 2950, 5700, 8900, 10560]

plt.plot(tags, ILCM, marker=".")
plt.plot(tags, CHEN, marker=".")




plt.xlabel("Число меток")

plt.ylabel("Количество слотов")

plt.legend(['ILCM', 'Chen'])

plt.grid()

plt.show()